# Análise IV
## Análisando a Frequencia das seleções
#### 1) Selecione somente os imóveis classifiados como tipo 'Apartamento'
#### 2) Selecione os imóveis com os tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'
#### 3) Selecione os imóveis com área entre 60 e 100 metros quadrados, incluíndo os limites
#### 4) Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$2000.00

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('aluguel_residencial.csv', sep = ';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

# 1) Selecione somente os imóveis classifiados como tipo 'Apartamento'

In [3]:
selecao_apartamento = dados.Tipo == 'Apartamento'
selecao_apartamento

0        False
1        False
2         True
3         True
4         True
         ...
22840     True
22841    False
22842     True
22843     True
22844     True
Name: Tipo, Length: 22845, dtype: bool

In [4]:
# a frequencia
n1 = dados[selecao_apartamento].shape[0]
n1

19532

# 2) Selecione os imóveis com os tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'

In [5]:
#selecao_casas = dados.Tipo == 'Casa' | dados.Tipo == 'Casa de Comdomínio' | dados.Tipo == 'Casa de Vila'
#selecao_casas # vai gerar um erro do jeito que ta na primeira linha tem que botar entre parenteses
selecao_casas = (dados.Tipo == 'Casa') | (dados.Tipo == 'Casa de Comdomínio') | (dados.Tipo == 'Casa de Vila')
selecao_casas
n2 = dados[selecao_casas].shape[0]
n2

1216

# 3) Selecione os imóveis com área entre 60 e 100 metros quadrados, incluíndo os limites

In [6]:
# é o equivalente a dizer que a área está 60 <= Area <= 100
selecao_area = (dados.Area >= 60) & (dados.Area <= 100)
selecao_area
n3 = dados[selecao_area].shape[0]
n3

8736

# 4) Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$2000.00

In [7]:
dados.head(10)
selecao_quartos = (dados.Quartos >= 4) & (dados.Valor < 2000)
selecao_quartos
n4 = dados[selecao_quartos].shape[0] # acho que tem que deixar entre [] pq to passando como se fosse uma lista?
n4

41

In [8]:
print("1) Selecione os imóveis classifiados como tipo 'Apartamento: '", n1)
print("2) Selecione os imóveis com os tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila': ", n2)
print("3) Selecione os imóveis com área entre 60 e 100 metros quadrados, incluíndo os limites: ", n3)
print("4) Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$2000.00: ", n4 )

1) Selecione os imóveis classifiados como tipo 'Apartamento: ' 19532
2) Selecione os imóveis com os tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila':  1216
3) Selecione os imóveis com área entre 60 e 100 metros quadrados, incluíndo os limites:  8736
4) Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$2000.00:  41

# exercicios alura

In [9]:
# exercicios alura
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [10]:
# 1) aprovadOs
alunos.head(10)
aprovados = (alunos.Aprovado == True) & (alunos.Sexo == 'M')
aprovados = alunos[aprovados]
aprovados

   Nome  Idade Sexo  Notas  Aprovado
0   Ary     15    M    7.5      True
3  Beto     32    M   10.0      True

In [11]:
# 2) apenas aprovadas
alunos.head(10)
aprovadas = (alunos.Aprovado == True) & (alunos.Sexo == 'F')
ex2 = alunos[aprovadas]
ex2

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [12]:
# 3) idade entre 10 e 20 anos OU com idade > 40
idades = (alunos.Idade > 10) & (alunos.Idade < 20) | (alunos.Idade > 40)
ex3 = alunos[idades]
ex3

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [13]:
# 4) Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.
alunos.head(10)
#reprovados = (alunos.Aprovado == False)
#reprovados
#reprovados = alunos[reprovados].drop(columns='Aprovado').drop(columns='Notas')
#reprovados.head(10)
#df.iloc[[2,0],[3,0]]
selecao = alunos.Aprovado == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']] # o loc é pra mexer com listas, e entao ele precisa ser tratado como lista na hora de chamar as coisas pra ele, os parametros tem q ser como lista
reprovados # Access a group of rows and columns by label(s) or a boolean array.
# ou seja pra acessarmos nome sexo e idade, precisamos pasasr eles como lista, e antes disso precisamos dizer nossa condição que no caso é aluno aprovado = false q ta na variavel selecao
# Allowed inputs are:
#A single label, e.g. 5 or 'a', (note that 5 is interpreted as a label of the index, and never as an integer position along the index).
#A list or array of labels, e.g. ['a', 'b', 'c']. # podemos passar assim tbm, como fizemos
#A slice object with labels, e.g. 'a':'f'.

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [14]:
alunos.head(10)

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [15]:
# outra resposta pro ex 4
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [16]:
# mais uma resposta pro exercicio 4
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [17]:
# 5) Crie uma visualização com os três alunos mais novos.
selecao = alunos.Idade
selecao.sort_values(ascending=True)
selecao = pd.DataFrame(selecao.sort_values(ascending=True))
tres_novos = [selecao.head(3)]
tres_novos

[   Idade
 0     15
 6     19
 5     21]

In [18]:
# uma resposta infinatemente melhor
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

In [19]:
alunos.head(10)

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True
1   Cátia     27    F    2.5     False
3    Beto     32    M   10.0      True
7   Alice     35    F    5.6     False
4   Bruna     42    F    8.2      True
2   Denis     56    M    5.0     False

# Extra - Formas de Seleções

In [20]:
'l1, l2, l3, l4 '.split() # o split vc passa uma string e ele já cria uma lista bonitin

['l1,', 'l2,', 'l3,', 'l4']

In [21]:
data = [(1,2,3,4),
        (5,6,7,8),
        (8,10,11,12),
        (13,14,15,16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'. split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [22]:
df['c1'] # selecionando uma coluna
# vai retornar uma series
type(df['c1'])

pandas.core.series.Series

In [23]:
# selecionando mais de uma coluna
df[['c3','c1']] # ai ja vira um dataframe
type(df[['c3','c1']])

pandas.core.frame.DataFrame

In [24]:
#selecionando linhas
df[:] # é aquele esqueminha com o :
# ele sempre vai comer o último selecionado

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [25]:
df[1:] # selecionando apartir da linha 1 até todo o resto

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [26]:
df[1:3] # l2 e l3, ele sempre vai comer a ultima entao temos que botar 1:3 o 3 vai pq é 1 a mais pq ele come a ultima

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [27]:
#linhas e colunas
df[1:4][['c3','c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [28]:
#metodo loc: ele permite que selecionamos apartir dos rótulos das linhas e retorna uma series
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [29]:
#selecionando mais de uma linha
df.loc[['l3', 'l4']]

    c1  c2  c3  c4
l3   8  10  11  12
l4  13  14  15  16

In [30]:
# selecionando linhas e colunas
df.loc['l1', 'c2']

2

In [31]:
#método iloc: ao invez de usar rótulos ele utiliza os indices númericos
df.iloc[0, 1] # posição da linha, dps posição da coluna

2

In [32]:
df
df.iloc[2,3] # linha 3 coluna 4 
# é bom esse metodo pq da pra usar loops

12

In [33]:
#selecionando grupos de linhas e colunas
df.loc[['l3','l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [34]:
# msm coisa da linha de cima mas com iloc usando índices
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1

In [35]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16